Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_iot_central_bg96/NonSecure/firmware/src/packs/PIC32CM5164LS60100_DFP/component/rtc.h
/* -------- RTC_TAMPID : (RTC Offset: 0x68) (R/W 32) Tamper ID -------- */
#define RTC_TAMPID_RESETVALUE                 _UINT32_(0x00)                                       /*  (RTC_TAMPID) Tamper ID  Reset Value */

#define RTC_TAMPID_TAMPID0_Pos                _UINT32_(0)                                          /* (RTC_TAMPID) Tamper Input 0 Detected Position */
#define RTC_TAMPID_TAMPID0_Msk                (_UINT32_(0x1) << RTC_TAMPID_TAMPID0_Pos)            /* (RTC_TAMPID) Tamper Input 0 Detected Mask */
#define RTC_TAMPID_TAMPID0(value)             (RTC_TAMPID_TAMPID0_Msk & (_UINT32_(value) << RTC_TAMPID_TAMPID0_Pos)) /* Assigment of value for TAMPID0 in the RTC_TAMPID register */
#define RTC_TAMPID_TAMPID1_Pos                _UINT32_(1)                                          /* (RTC_TAMPID) Tamper Input 1 Detected Position */
#define RTC_TAMPID_TAMPID1_Msk                (_UINT32_(0x1) << RTC_TAMPID_TAMPID1_Pos)            /* (RTC_TAMPID) Tamper Input 1 Detected Mask */
#define RTC_TAMPID_TAMPID1(value)             (RTC_TAMPID_TAMPID1_Msk & (_UINT32_(value) << RTC_TAMPID_TAMPID1_Pos)) /* Assigment of value for TAMPID1 in the RTC_TAMPID register */
#define RTC_TAMPID_TAMPID2_Pos                _UINT32_(2)                                          /* (RTC_TAMPID) Tamper Input 2 Detected Position */
#define RTC_TAMPID_TAMPID2_Msk                (_UINT32_(0x1) << RTC_TAMPID_TAMPID2_Pos)            /* (RTC_TAMPID) Tamper Input 2 Detected Mask */
#define RTC_TAMPID_TAMPID2(value)             (RTC_TAMPID_TAMPID2_Msk & (_UINT32_(value) << RTC_TAMPID_TAMPID2_Pos)) /* Assigment of value for TAMPID2 in the RTC_TAMPID register */
#define RTC_TAMPID_TAMPID3_Pos                _UINT32_(3)                                          /* (RTC_TAMPID) Tamper Input 3 Detected Position */
#define RTC_TAMPID_TAMPID3_Msk                (_UINT32_(0x1) << RTC_TAMPID_TAMPID3_Pos)            /* (RTC_TAMPID) Tamper Input 3 Detected Mask */
#define RTC_TAMPID_TAMPID3(value)             (RTC_TAMPID_TAMPID3_Msk & (_UINT32_(value) << RTC_TAMPID_TAMPID3_Pos)) /* Assigment of value for TAMPID3 in the RTC_TAMPID register */
#define RTC_TAMPID_TAMPID4_Pos                _UINT32_(4)                                          /* (RTC_TAMPID) Tamper Input 4 Detected Position */
#define RTC_TAMPID_TAMPID4_Msk                (_UINT32_(0x1) << RTC_TAMPID_TAMPID4_Pos)            /* (RTC_TAMPID) Tamper Input 4 Detected Mask */
#define RTC_TAMPID_TAMPID4(value)             (RTC_TAMPID_TAMPID4_Msk & (_UINT32_(value) << RTC_TAMPID_TAMPID4_Pos)) /* Assigment of value for TAMPID4 in the RTC_TAMPID register */
#define RTC_TAMPID_TAMPID5_Pos                _UINT32_(5)                                          /* (RTC_TAMPID) Tamper Input 5 Detected Position */
#define RTC_TAMPID_TAMPID5_Msk                (_UINT32_(0x1) << RTC_TAMPID_TAMPID5_Pos)            /* (RTC_TAMPID) Tamper Input 5 Detected Mask */
#define RTC_TAMPID_TAMPID5(value)             (RTC_TAMPID_TAMPID5_Msk & (_UINT32_(value) << RTC_TAMPID_TAMPID5_Pos)) /* Assigment of value for TAMPID5 in the RTC_TAMPID register */
#define RTC_TAMPID_TAMPID6_Pos                _UINT32_(6)                                          /* (RTC_TAMPID) Tamper Input 6 Detected Position */
#define RTC_TAMPID_TAMPID6_Msk                (_UINT32_(0x1) << RTC_TAMPID_TAMPID6_Pos)            /* (RTC_TAMPID) Tamper Input 6 Detected Mask */
#define RTC_TAMPID_TAMPID6(value)             (RTC_TAMPID_TAMPID6_Msk & (_UINT32_(value) << RTC_TAMPID_TAMPID6_Pos)) /* Assigment of value for TAMPID6 in the RTC_TAMPID register */
#define RTC_TAMPID_TAMPID7_Pos                _UINT32_(7)                                          /* (RTC_TAMPID) Tamper Input 7 Detected Position */
#define RTC_TAMPID_TAMPID7_Msk                (_UINT32_(0x1) << RTC_TAMPID_TAMPID7_Pos)            /* (RTC_TAMPID) Tamper Input 7 Detected Mask */
#define RTC_TAMPID_TAMPID7(value)             (RTC_TAMPID_TAMPID7_Msk & (_UINT32_(value) << RTC_TAMPID_TAMPID7_Pos)) /* Assigment of value for TAMPID7 in the RTC_TAMPID register */
#define RTC_TAMPID_TAMPEVT_Pos                _UINT32_(31)                                         /* (RTC_TAMPID) Tamper Event Detected Position */
#define RTC_TAMPID_TAMPEVT_Msk                (_UINT32_(0x1) << RTC_TAMPID_TAMPEVT_Pos)            /* (RTC_TAMPID) Tamper Event Detected Mask */
#define RTC_TAMPID_TAMPEVT(value)             (RTC_TAMPID_TAMPEVT_Msk & (_UINT32_(value) << RTC_TAMPID_TAMPEVT_Pos)) /* Assigment of value for TAMPEVT in the RTC_TAMPID register */
#define RTC_TAMPID_Msk                        _UINT32_(0x800000FF)                                 /* (RTC_TAMPID) Register Mask  */

#define RTC_TAMPID_TAMPID_Pos                 _UINT32_(0)                                          /* (RTC_TAMPID Position) Tamper Input x Detected */
#define RTC_TAMPID_TAMPID_Msk                 (_UINT32_(0xFF) << RTC_TAMPID_TAMPID_Pos)            /* (RTC_TAMPID Mask) TAMPID */
#define RTC_TAMPID_TAMPID(value)              (RTC_TAMPID_TAMPID_Msk & (_UINT32_(value) << RTC_TAMPID_TAMPID_Pos)) 

/* -------- RTC_TAMPCTRLB : (RTC Offset: 0x6C) (R/W 32) Tamper Control B -------- */
#define RTC_TAMPCTRLB_RESETVALUE              _UINT32_(0x00)                                       /*  (RTC_TAMPCTRLB) Tamper Control B  Reset Value */

#define RTC_TAMPCTRLB_ALSI0_Pos               _UINT32_(0)                                          /* (RTC_TAMPCTRLB) Active Layer Select Internal 0 Position */
#define RTC_TAMPCTRLB_ALSI0_Msk               (_UINT32_(0x1) << RTC_TAMPCTRLB_ALSI0_Pos)           /* (RTC_TAMPCTRLB) Active Layer Select Internal 0 Mask */
#define RTC_TAMPCTRLB_ALSI0(value)            (RTC_TAMPCTRLB_ALSI0_Msk & (_UINT32_(value) << RTC_TAMPCTRLB_ALSI0_Pos)) /* Assigment of value for ALSI0 in the RTC_TAMPCTRLB register */
#define RTC_TAMPCTRLB_ALSI1_Pos               _UINT32_(1)                                          /* (RTC_TAMPCTRLB) Active Layer Select Internal 1 Position */
#define RTC_TAMPCTRLB_ALSI1_Msk               (_UINT32_(0x1) << RTC_TAMPCTRLB_ALSI1_Pos)           /* (RTC_TAMPCTRLB) Active Layer Select Internal 1 Mask */
#define RTC_TAMPCTRLB_ALSI1(value)            (RTC_TAMPCTRLB_ALSI1_Msk & (_UINT32_(value) << RTC_TAMPCTRLB_ALSI1_Pos)) /* Assigment of value for ALSI1 in the RTC_TAMPCTRLB register */
#define RTC_TAMPCTRLB_ALSI2_Pos               _UINT32_(2)                                          /* (RTC_TAMPCTRLB) Active Layer Select Internal 2 Position */
#define RTC_TAMPCTRLB_ALSI2_Msk               (_UINT32_(0x1) << RTC_TAMPCTRLB_ALSI2_Pos)           /* (RTC_TAMPCTRLB) Active Layer Select Internal 2 Mask */
#define RTC_TAMPCTRLB_ALSI2(value)            (RTC_TAMPCTRLB_ALSI2_Msk & (_UINT32_(value) << RTC_TAMPCTRLB_ALSI2_Pos)) /* Assigment of value for ALSI2 in the RTC_TAMPCTRLB register */
#define RTC_TAMPCTRLB_ALSI3_Pos               _UINT32_(3)                                          /* (RTC_TAMPCTRLB) Active Layer Select Internal 3 Position */
#define RTC_TAMPCTRLB_ALSI3_Msk               (_UINT32_(0x1) << RTC_TAMPCTRLB_ALSI3_Pos)           /* (RTC_TAMPCTRLB) Active Layer Select Internal 3 Mask */
#define RTC_TAMPCTRLB_ALSI3(value)            (RTC_TAMPCTRLB_ALSI3_Msk & (_UINT32_(value) << RTC_TAMPCTRLB_ALSI3_Pos)) /* Assigment of value for ALSI3 in the RTC_TAMPCTRLB register */
#define RTC_TAMPCTRLB_ALSI4_Pos               _UINT32_(4)                                          /* (RTC_TAMPCTRLB) Active Layer Select Internal 4 Position */
#define RTC_TAMPCTRLB_ALSI4_Msk               (_UINT32_(0x1) << RTC_TAMPCTRLB_ALSI4_Pos)           /* (RTC_TAMPCTRLB) Active Layer Select Internal 4 Mask */
#define RTC_TAMPCTRLB_ALSI4(value)            (RTC_TAMPCTRLB_ALSI4_Msk & (_UINT32_(value) << RTC_TAMPCTRLB_ALSI4_Pos)) /* Assigment of value for ALSI4 in the RTC_TAMPCTRLB register */
#define RTC_TAMPCTRLB_ALSI5_Pos               _UINT32_(5)                                          /* (RTC_TAMPCTRLB) Active Layer Select Internal 5 Position */
#define RTC_TAMPCTRLB_ALSI5_Msk               (_UINT32_(0x1) << RTC_TAMPCTRLB_ALSI5_Pos)           /* (RTC_TAMPCTRLB) Active Layer Select Internal 5 Mask */
#define RTC_TAMPCTRLB_ALSI5(value)            (RTC_TAMPCTRLB_ALSI5_Msk & (_UINT32_(value) << RTC_TAMPCTRLB_ALSI5_Pos)) /* Assigment of value for ALSI5 in the RTC_TAMPCTRLB register */
#define RTC_TAMPCTRLB_ALSI6_Pos               _UINT32_(6)                                          /* (RTC_TAMPCTRLB) Active Layer Select Internal 6 Position */
#define RTC_TAMPCTRLB_ALSI6_Msk               (_UINT32_(0x1) << RTC_TAMPCTRLB_ALSI6_Pos)           /* (RTC_TAMPCTRLB) Active Layer Select Internal 6 Mask */
#define RTC_TAMPCTRLB_ALSI6(value)            (RTC_TAMPCTRLB_ALSI6_Msk & (_UINT32_(value) << RTC_TAMPCTRLB_ALSI6_Pos)) /* Assigment of value for ALSI6 in the RTC_TAMPCTRLB register */
#define RTC_TAMPCTRLB_ALSI7_Pos               _UINT32_(7)                                          /* (RTC_TAMPCTRLB) Active Layer Select Internal 7 Position */
#define RTC_TAMPCTRLB_ALSI7_Msk               (_UINT32_(0x1) << RTC_TAMPCTRLB_ALSI7_Pos)           /* (RTC_TAMPCTRLB) Active Layer Select Internal 7 Mask */
#define RTC_TAMPCTRLB_ALSI7(value)            (RTC_TAMPCTRLB_ALSI7_Msk & (_UINT32_(value) << RTC_TAMPCTRLB_ALSI7_Pos)) /* Assigment of value for ALSI7 in the RTC_TAMPCTRLB register */
#define RTC_TAMPCTRLB_Msk                     _UINT32_(0x000000FF)                                 /* (RTC_TAMPCTRLB) Register Mask  */

